tutorials/featureCases/3D_nuclearCyclone/system/fluidRegion/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Background mesh for the cyclone geometry, reused from the stock OpenFOAM
// lagrangian/MPPICFoam/cyclone tutorial.

scale   1;

vertices
(

    (-0.55 -0.55 -1  )
    ( 0.55 -0.55 -1  )
    ( 0.55  0.55 -1  )
    (-0.55  0.55 -1  )

    (-0.55 -0.55  1.1)
    ( 0.55 -0.55  1.1)
    ( 0.55  0.55  1.1)
    (-0.55  0.55  1.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 33 63) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
