tutorials/featureCases/3D_nuclearCyclone/constant/fluidRegion/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Continuous phase: air, same as the stock cyclone tutorial
transportModel  Newtonian;
nu              1.568e-05;

// Reference density for the continuous phase (used by the Lagrangian cloud)
rhoInf          1.2;

// Boussinesq / energy-equation properties (nuclearParcelFoam)
beta            3.43e-03;
CpRef           1005;
TRef            293;
Pr              0.7;
Prt             0.85;


// ************************************************************************* //
